In [1]:
import pandas as pd
df = pd.read_csv('salaries.csv')
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [2]:
X = df.drop('salary_more_then_100k', axis=1)
y =df['salary_more_then_100k']

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [5]:
X['company_n']= le_company.fit_transform(X['company'])
X['job_n']= le_company.fit_transform(X['job'])
X['degree_n']= le_company.fit_transform(X['degree'])
X.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [6]:
X1 = X.drop(['company','job', 'degree'], axis=1)
X1

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [7]:
from sklearn.tree import DecisionTreeClassifier
dtc = DecisionTreeClassifier()

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
X_train,X_test,y_train,y_test = train_test_split(X1,y,test_size=0.2)

In [10]:
dtc.fit(X_train,y_train)

DecisionTreeClassifier()

In [11]:
dtc.score(X_train,y_train)

1.0

In [12]:
y_preds= dtc.predict(X_test)
y_preds

array([0, 1, 0, 0])

In [13]:
from sklearn.metrics import accuracy_score,confusion_matrix

In [14]:
ac_score = accuracy_score(y_test,y_preds)
ac_score

0.5

In [15]:
dtc.predict([[2,2,1]])

/Users/gurkirpalparmar/opt/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0])